Revit 2027 API
DirectShapeType.SetShape Method
Overload List
Name | Description
SetShape(IList<GeometryObject>) |  Builds the type shape from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept.
SetShape(ShapeBuilder) |  Sets the shape of this object to the one accumulated in the supplied Builder object. If the new shape is identical to the old one, the old shape will be kept.
SetShape(IList<GeometryObject>, DirectShapeTargetViewType) |  Builds the type shape from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept.
Top
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace